app/controllers/admin/brands_controller.rb

INSERT INTO "brands" ("brand_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["brand_name", "Fiat"], ["created_at", "2018-03-21 12:55:22.477120"], ["updated_at", "2018-03-21 12:55:22.477120"]]
---
  def create
    @brand = Brand.create(brand_params)

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @brand = Brand.find(params[:id])

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "brands" SET "brand_name" = $1, "updated_at" = $2 WHERE "brands"."id" = $3  [["brand_name", "Lifan"], ["updated_at", "2018-03-21 12:58:31.219792"], ["id", 8]]
---
  def update
    @brand = Brand.find(params[:id])
    if @brand.update(brand_params)

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "brands" WHERE "brands"."id" = $1  [["id", 2]]
---
  def destroy
    brand = Brand.find(params[:id])
    brand.destroy