app/controllers/admin/break_categories_controller.rb

    def index
      categories = BreakCategory.joins(:break_sub_categories).select(
        'break_categories.break_category_name,
        break_sub_categories.break_sub_category_name,
        break_sub_categories.price'
      )
---
SELECT break_categories.name FROM "break_categories" LEFT OUTER JOIN "break_sub_categories" ON "break_sub_categories"."break_category_id" = "break_categories"."id" WHERE (break_sub_categories.category_id = break_categories.id)

    def create
      BreakCategory.create(brake_category_params)
---
INSERT INTO "break_categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Клімат система"], ["created_at", "2018-03-14 08:03:14.231783"], ["updated_at", "2018-03-14 08:03:14.231783"]]

    def edit
      @break_category = BreakCategory.find(params[:id])
---
SELECT  "break_categories".* FROM "break_categories" WHERE "break_categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
      @break_sub_category = BreakCategory.find(params[:id])
      if @break_sub_category.update(brake_category_params)
---
SELECT  "break_categories".* FROM "break_categories" WHERE "break_categories"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "break_categories" SET "name" = $1, "updated_at" = $2 WHERE "break_categories"."id" = $3  [["name", "Fue"], ["updated_at", "2018-03-14 09:12:04.840512"], ["id", 5]]

    def destroy
      break_category = BreakCategory.find(params[:id])
      break_category.destroy
---
SELECT  "break_categories".* FROM "break_categories" WHERE "break_categories"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "break_categories" WHERE "break_categories"."id" = $1  [["id", 4]]