app/controllers/admin/break_sub_categories_controller.rb

SELECT "break_categories"."id" FROM "break_categories"
---
    def new
      @break_category = BreakCategory.all

SELECT  "break_categories".* FROM "break_categories" WHERE "break_categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "break_sub_categories" ("break_category_id", "break_sub_category_name", "created_at", "updated_at", "price") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["break_category_id", 3], ["break_sub_category_name", "Led"], ["created_at", "2018-03-14 09:31:15.783343"], ["updated_at", "2018-03-14 09:31:15.783343"], ["price", 500.0]]
---
    def create
      @break_category = BreakCategory.find(category_params[:break_category_id])
      @break_category.break_sub_categories.create(break_sub_category_params)

SELECT  "break_sub_categories".* FROM "break_sub_categories" WHERE "break_sub_categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def edit
      @sub_category = BreakSubCategory.find(params[:id])

SELECT  "break_sub_categories".* FROM "break_sub_categories" WHERE "break_sub_categories"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "break_sub_categories" SET "break_sub_category_name" = $1, "price" = $2, "updated_at" = $3 WHERE "break_sub_categories"."id" = $4  [["break_sub_category_name", "Заміна ремня ГРМ"], ["price", 12.0], ["updated_at", "2018-03-15 13:50:29.253180"], ["id", 19]]
---
    def update
      @sub_category = BreakSubCategory.find(params[:id])
      if @sub_category.update(break_sub_category_params)

SELECT  "break_sub_categories".* FROM "break_sub_categories" WHERE "break_sub_categories"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "break_sub_categories" WHERE "break_sub_categories"."id" = $1  [["id", 16]]
---
    def destroy
      sub_category = BreakSubCategory.find(params[:id])
      sub_category.destroy