app/controllers/admin/car_models_controller.rb

SELECT "brands".* FROM "brands"
---
  def new
    @brands = Brand.all

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "car_models" ("model", "brand_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["model", "520"], ["brand_id", 1], ["created_at", "2018-03-11 09:56:52.179644"], ["updated_at", "2018-03-11 09:56:52.179644"]]
---
  def create
    @brand = Brand.find(brand_p[:brand_id])
    @brand.car_models.create(car_params)

SELECT  "car_models".* FROM "car_models" WHERE "car_models"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @car = CarModel.find(params[:id])

SELECT  "car_models".* FROM "car_models" WHERE "car_models"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "car_models" SET "model" = $1, "updated_at" = $2 WHERE "car_models"."id" = $3  [["model", "530"], ["updated_at", "2018-03-11 10:09:03.764805"], ["id", 1]]
---
  def update
    @car = CarModel.find(params[:id])
    if @car.update(car_params)

SELECT  "car_models".* FROM "car_models" WHERE "car_models"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "car_models" WHERE "car_models"."id" = $1  [["id", 1]]
---
  def destroy
    car = CarModel.find(params[:id])
    car.destroy