app/controllers/admin/garages_controller.rb

INSERT INTO "garages" ("user_id", "garage_name", "description", "city", "address", "phone", "diler", "image", "garage_types", "work_shedule", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
    def create
      # render plain: break_category_params
      Garage.create(garage_params)

SELECT  "garages".* FROM "garages" WHERE "garages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
      @garage = Garage.find(params[:id])

SELECT  "garages".* FROM "garages" WHERE "garages"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "garages" SET "image" = $1, "work_shedule" = $2, "garage_types" = $3, "updated_at" = $4 WHERE "garages"."id" = $5  [["image", nil], ["work_shedule", "{10-15,10-15,\"  10-12\"}"], ["garage_types", "{\"\",Майстерня,Автомийка}"], ["updated_at", "2018-03-20 20:29:58.394749"], ["id", 2]]
---
    def update
      garage = Garage.find(params[:id])
      if garage.update(garage_params)

SELECT  "garages".* FROM "garages" WHERE "garages"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "garages" WHERE "garages"."id" = $1  [["id", 3]]
---
    def destroy
      garage = Garage.find(params[:id])
      garage.destroy