app/controllers/admin/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "roles" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["roles", "{\"\",Адміністратор}"], ["updated_at", "2018-03-20 17:21:38.978713"], ["id", 4]]
---
    def update
      user = User.find(params[:id])
      if user.update(user_params)