app/views/admin/garages/index.html.erb

    <td>
      <% garage.garage_types.each do |garage_type| %>
---
SELECT "garages".* FROM "garages"