app/views/admin/break_sub_categories/new.html.erb

    <p>Назва категорії поломки авто
      <%= form.select("break_category_id", BreakCategory.all.collect{|p| [ p.name, p.id ] }) %>
---
SELECT "break_categories"."id" FROM "break_categories"