app/controllers/home_controller.rb

SELECT "garages".* FROM "garages"
---
  def index
    @garages = Garage.all