app/controllers/profile_controller.rb

SELECT brands.brand, car_models.model, user_cars.car_year FROM "brands" INNER JOIN "user_cars" ON "user_cars"."id" = "brands"."user_car_id" INNER JOIN "car_models" ON "car_models"."brand_id" = "brands"."id" WHERE (user_id = 2)
SELECT brands.brand, car_models.model, user_cars.car_year, user_cars.user_id FROM "user_cars" INNER JOIN "brands" ON "brands"."user_car_id" = "user_cars"."id" INNER JOIN "car_models" ON "car_models"."user_car_id" = "user_cars"."id" INNER JOIN "users" ON "users"."user_car_id" = "user_cars"."id" WHERE (user_id = NULL)
---
  def index
    @user_id = current_user.id
    @user_car = UserCar.joins(:car_model, :brand).select(
      'car_models.model, user_cars.car_year, brands.brand_name, user_cars.id'
    ).where('user_id = ? and brands.id = user_cars.brand_id', @user_id)

INSERT INTO "user_cars" ("car_model_id", "user_id", "created_at", "updated_at", "car_year", "brand_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["car_model_id", 9], ["user_id", 2], ["created_at", "2018-03-21 11:39:11.593008"], ["updated_at", "2018-03-21 11:39:11.593008"], ["car_year", 1990], ["brand_id", 5]]
---
  def create
    user_car = UserCar.new(profile_params)
    user_car.save

SELECT  "user_cars".* FROM "user_cars" WHERE "user_cars"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "user_cars" WHERE "user_cars"."id" = $1  [["id", 2]]
---
  def destroy
    user_car = UserCar.find(params[:id])
    user_car.destroy