app/views/profile/index.html.erb

    <%= form.label "Brand"%>
    <%= form.collection_select :brand_id, Brand.order(:brand_name), :id, :brand_name %>
---
SELECT "brands".* FROM "brands" ORDER BY "brands"."brand_name" ASC