app/views/profile/index.html.erb

    <%= form.label "Марка"%>
    <%= form.collection_select :brand_id, Brand.order(:brand), :id, :brand, include_blank: true%>
---
SELECT "brands".* FROM "brands" ORDER BY "brands"."brand" ASC

    <%= form.label "Модель"%>
    <%= form.grouped_collection_select :model_id, Brand.order(:brand), :car_models, :brand, :id, :model %>
---
SELECT "car_models".* FROM "car_models" WHERE "car_models"."brand_id" = $1  [["brand_id", 1]]